# Pandas

In [208]:
import pandas as pd

# DataFrame 생성

In [209]:
s1 = pd.Series( [ 4000, 20000, 10000 ],                                   # Series객체 하나가 하나의 행이 되는 것
              index = [ 
                  '2020-6-15', '2020-6-16', '2020-6-17' ] )
s2 = pd.Series( [ 5000, 8000, 11000 ],
              index = [ '2020-6-15', '2020-6-16', '2020-6-17' ] )
s3 = pd.Series( [ 6000, 9000, 12000 ],
              index = [ '2020-6-15', '2020-6-16', '2020-6-17' ] )
df = pd.DataFrame( [ s1, s2, s3 ] )
df

   2020-6-15  2020-6-16  2020-6-17
0       4000      20000      10000
1       5000       8000      11000
2       6000       9000      12000

In [210]:
indexs = [ 'name', 'kor', 'eng', 'sci' ]
hong = pd.Series( [ 'hong', 50, 50, 50 ],index = indexs )
kim = pd.Series( [ 'kim', 90, 90, 90 ],index = indexs )
lee = pd.Series( [ 'lee', 70, 70, 70 ],index = indexs )
df = pd.DataFrame( [ hong, kim, lee ], index = [ 1, 2, 3 ] )
df

   name  kor  eng  sci
1  hong   50   50   50
2   kim   90   90   90
3   lee   70   70   70

In [211]:
import numpy as np

In [212]:
df.index

Int64Index([1, 2, 3], dtype='int64')

In [213]:
df.columns

Index(['name', 'kor', 'eng', 'sci'], dtype='object')

In [214]:
df.values

array([['hong', 50, 50, 50],
       ['kim', 90, 90, 90],
       ['lee', 70, 70, 70]], dtype=object)

In [215]:
data = np.array( [ [ 10, 20, 30, 40 ], [ 100, 200, 300, 400 ] ] )
index_list = pd.date_range( '2020-06-15', periods = 2 )
col_list = [ 'A', 'B', 'C', 'D' ]
df =pd.DataFrame( data, index = index_list, columns = col_list )
df

              A    B    C    D
2020-06-15   10   20   30   40
2020-06-16  100  200  300  400

In [216]:
df.index

DatetimeIndex(['2020-06-15', '2020-06-16'], dtype='datetime64[ns]', freq='D')

In [217]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [218]:
df.values

array([[ 10,  20,  30,  40],
       [100, 200, 300, 400]])

### DataFrame의 행 인덱스 또는 열 이름 변경

- rename() 메서드 이용
- 원본 객체 변경시에는 inplace = True 옵션 사용

In [219]:
df = pd.DataFrame( [ [ 50, 50, 50 ], [ 90, 90, 90 ], [ 70, 70, 70 ] ],
              index = [ 'hong', 'kim', 'lee' ],
              columns = [ 'kor', 'eng', 'sci' ] )
df

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [220]:
df2 = df[ : ] # DataFrame 복사(내용만 복사), df2 = df랑 다름, 내용은 같지만 별개의 데이터 프레임
df2

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [221]:
df2.rename( columns = { 'kor' : 'subject1',                    # column 이름만 바꾼 것 
                        'eng' : 'subject2',
                        'sci' : 'subject3' } )

      subject1  subject2  subject3
hong        50        50        50
kim         90        90        90
lee         70        70        70

In [222]:
df2                                                           # 원본 df2는 안바뀜

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [223]:
df2.rename( columns = { 'kor' : 'subject1',                   
                        'eng' : 'subject2',
                        'sci' : 'subject3' }, inplace = True )    # inplace = True 하기

In [224]:
df2                                                               # 원본에 적용

      subject1  subject2  subject3
hong        50        50        50
kim         90        90        90
lee         70        70        70

In [225]:
df                                                                 # 복사한 df2에만 적용 df는 적용x

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [226]:
df2.rename( index = { 'hong' : 'hong gil dong',
                      'kim' : 'kim gil dong',   
                      'lee' : 'lee gil dong'} )

               subject1  subject2  subject3
hong gil dong        50        50        50
kim gil dong         90        90        90
lee gil dong         70        70        70

In [227]:
df2

      subject1  subject2  subject3
hong        50        50        50
kim         90        90        90
lee         70        70        70

### 행/열 삭제

- DataFrame의 행/열 삭제는 drop() 메서드 사용
- 행을 삭제할 때는 축( axis )옵션으로 axis = 0을 입력하거나, 별도로 입력하지 않는다.
- 축( axis )옵션으로 axis = 1은 열을 삭제할 때 부여한다
- 동시에 여러 개의 행 또는 열을 삭제하려면 리스트 형태로 입력한다.
- 원본 객체 변경시에는 inplace = True 옵션 사용

In [228]:
df2.drop( 'lee' )

      subject1  subject2  subject3
hong        50        50        50
kim         90        90        90

In [229]:
df2.drop( 'subject3', axis = 1, inplace = True )

In [230]:
df2 = df[ : ]            # 전체 내용 복사
df2

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [231]:
df2.drop( [ 'hong', 'lee' ] )

     kor  eng  sci
kim   90   90   90

In [232]:
df2.drop( [ 'kor', 'eng' ], axis = 1 )

      sci
hong   50
kim    90
lee    70

### 행 선택

- DataFrame의 행 데이터를 선택하기 위해서는 loc와 iloc 인덱서를 사용한다.
- 인덱스 이름을 기준으로 행을 선택할 때는 loc를 사용한다.
- 정수형 위치 인덱스를 사용할 때는 iloc를 사용한다.

In [233]:
df2.iloc[ 0 ]

kor    50
eng    50
sci    50
Name: hong, dtype: int64

In [234]:
df2.loc[ 'hong' ]

kor    50
eng    50
sci    50
Name: hong, dtype: int64

In [235]:
df2.iloc[ [ 0, 2 ] ]   # 0행과 2행 인덱스 위치값 표시한 것 (정수 인덱스를 사용해서 iloc) 리스트로 묶는다 [],
                       #     [[]]로 하면 데이터프레임으로 나옴, []로만 묶으면 Series객체로 나옴

      kor  eng  sci
hong   50   50   50
lee    70   70   70

In [236]:
df2.loc[ [ 'hong', 'kim' ] ]     # 홍과 김의 인덱스값을 표시한 것 ( loc 사용 )           # 리스트로 묶는다[]

      kor  eng  sci
hong   50   50   50
kim    90   90   90

In [237]:
df2.iloc[ 0:2 ]       # 리스트로 [[]]두번 묶지 않았지만 여러 행을 선택해서 데이터프레임으로 나온다.

      kor  eng  sci
hong   50   50   50
kim    90   90   90

In [238]:
df2.loc[ 'hong':'lee' ]    # 리스트로 [[]]두번 묶지 않았지만 여러 행을 선택해서 데이터프레임으로 나온다.

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

### 열 선택

- DataFrame의 열 데이터를 한 개만 선택할 때는, []안에 열이름을 ' 또는 "와 함께 입력하거나 도트( . ) 다음에 열 이름을 입력하는
  두가지 방식이 있다.
- 도트( . )를 사용하는 방식에서는 반드시 열 이름이 문자열일 경우만 가능하다.
- 열 한 개만 선택하면 시리즈 객체가 반환된다.
- []안에 열 이름의 리스트를 입력하면 리스트의 원소인 열을 모두 선택하여 DataFrame으로 반환한다.

In [239]:
df2[ 'kor' ]

hong    50
kim     90
lee     70
Name: kor, dtype: int64

In [240]:
df2.kor              # Series 객체로 나옴(마우스를 대도 색이 안변함)

hong    50
kim     90
lee     70
Name: kor, dtype: int64

In [241]:
df2[ [ 'kor', 'sci' ] ]

      kor  sci
hong   50   50
kim    90   90
lee    70   70

In [242]:
df2[ [ 'sci' ] ]    # []대괄호가 두개 묶이면 무조건 데이터프레임으로 나온다 []하나만 묶이면 Series로 나옴

      sci
hong   50
kim    90
lee    70

### 범위 슬라이싱을 이용한 행 선택

In [243]:
df2.iloc[  ::2 ]   # 처음부터 끝까지 2간격으로

      kor  eng  sci
hong   50   50   50
lee    70   70   70

In [244]:
df2.iloc[  ::-1 ]   # 처음부터 끝까지 역순으로

      kor  eng  sci
lee    70   70   70
kim    90   90   90
hong   50   50   50

In [245]:
df2.iloc[ 0:3:2 ]

      kor  eng  sci
hong   50   50   50
lee    70   70   70

## 요소 선택

- DataFrame의 행 인덱스와 열 이름을 [행, 열 ] 형식의 2차원 좌표로 입력하여 입력하여 요소 위치를 지정하는 방법이다.,
- 1개의 행과 2개 이상의 열을 선택하거나 2개 이상의 행과 1개의 열을 선택하는 경우 Series객체가 반환된다.
- 2개 이상의 행과 2개 이상의 열을 선택하면 DataFrame 객체를 반환한다.

In [246]:
df2

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [247]:
df2.iloc[ 0, 0 ]

50

In [248]:
df2.iloc[ 1, 0 ]

90

In [249]:
df2.loc[ 'hong', 'kor' ]

50

In [250]:
df2.loc[ 'kim', 'kor' ]

90

In [251]:
df2.iloc[ 0, [ 2, 1 ] ]

sci    50
eng    50
Name: hong, dtype: int64

In [252]:
df2.loc[ 'hong', [ 'sci', 'eng' ] ]

sci    50
eng    50
Name: hong, dtype: int64

In [253]:
df2.iloc[ [ 0, 2 ], [ 2, 0 ] ]

      sci  kor
hong   50   50
lee    70   70

In [254]:
df2.loc[ [ 'kim', 'hong' ], [ 'kor', 'eng' ] ]

      kor  eng
kim    90   90
hong   50   50

In [255]:
df2.loc[ 'hong':'kim',  'kor':'eng' ]

      kor  eng
hong   50   50
kim    90   90

In [256]:
df2 = df[ : ]
df2

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [257]:
df2.iloc[ 0, 0 ] = 55
df2

      kor  eng  sci
hong   55   50   50
kim    90   90   90
lee    70   70   70

In [258]:
df2.loc[ [ 'hong', 'kim' ], [ 'eng', 'sci' ] ] = 98
df2

      kor  eng  sci
hong   55   98   98
kim    90   98   98
lee    70   70   70

In [259]:
df2

      kor  eng  sci
hong   55   98   98
kim    90   98   98
lee    70   70   70

### 열추가

In [260]:
df2[ 'math' ] = 88
df2

      kor  eng  sci  math
hong   55   98   98    88
kim    90   98   98    88
lee    70   70   70    88

In [261]:
df2[ 'math2' ] = [ 88, 92, 81 ]
df2

      kor  eng  sci  math  math2
hong   55   98   98    88     88
kim    90   98   98    88     92
lee    70   70   70    88     81

### 행추가
- 추가하려는 행이름과 데이터 값을 loc 인덱서를 사용하여 입력한다.
- 하나의 데이터 값을 입력하거나 열의 개수에 맞게 데이터를 입력하여 추가한다.

In [262]:
df2.loc[ 3 ] = 0
df2

      kor  eng  sci  math  math2
hong   55   98   98    88     88
kim    90   98   98    88     92
lee    70   70   70    88     81
3       0    0    0     0      0

In [263]:
df2.loc[ 'park' ] = [ 78, 72, 71, 75, 74 ]   # 데이터를 열의 수만큼 맞춰 넣는다.
df2

      kor  eng  sci  math  math2
hong   55   98   98    88     88
kim    90   98   98    88     92
lee    70   70   70    88     81
3       0    0    0     0      0
park   78   72   71    75     74

### Series/DataFrame 연산

In [264]:
s1 = pd.Series( [ 1, 2, 3, 4, 5 ] )
s2 = pd.Series( [ 10, 20, 30, 40, 50 ] )

In [265]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [266]:
s2

0    10
1    20
2    30
3    40
4    50
dtype: int64

### Series와 scalar 간의 연산

In [267]:
s1 * 5

0     5
1    10
2    15
3    20
4    25
dtype: int64

In [268]:
s1 / 2

0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
dtype: float64

### Series와 Series 간 연산

In [269]:
s1 + s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [270]:
s2 / s1

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [271]:
s1 = pd.Series( { 'kor': 50, 'eng':70, 'sci':90 } )
s1

kor    50
eng    70
sci    90
dtype: int64

In [272]:
s2 = pd.Series( { 'sci': 77, 'kor':52, 'eng':30 } )      
s2

sci    77
kor    52
eng    30
dtype: int64

In [273]:
s1  + s2                # Series 인덱스 갯수와 이름은 같지만 위치는 다르다 그치만 연산은 잘 됨 -> 인덱스 맞 맞으면 연산이 가능

eng    100
kor    102
sci    167
dtype: int64

In [274]:
s1 = pd.Series( { 'kor': 50, 'eng':30, 'sci':90 } )
s1

kor    50
eng    30
sci    90
dtype: int64

In [275]:
s2 = pd.Series( { 'sci': 95, 'kor':80, 'math':72 } )
s2

sci     95
kor     80
math    72
dtype: int64

In [276]:
s1 + s2                  #  Series간 연산은 같지 않은 게 포함된 Series끼리 연산은 Nan이 나오는 단점이 있음

eng       NaN
kor     130.0
math      NaN
sci     185.0
dtype: float64

In [277]:
s1.add( s2, fill_value = 0 )   # 연산 메소드, / fill_value -> 각 Series에 요소가 없으면 그 자리에 값을 0으로 채워라 (nan 대체)
                               # 즉 s1에 math가 없으니 그 자리 값을 0으로 채우면 연산이 가능

eng      30.0
kor     130.0
math     72.0
sci     185.0
dtype: float64

### DataFrame과 Scalar간 연산

In [278]:
data = { 'kor':[ 50, 90, 70 ], 'eng': [ 50, 90, 70 ], 'sci': [ 50, 90, 70 ] }
index_list = [ 'hong', 'kim', 'lee' ]
df = pd.DataFrame( data, index = index_list )
df

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [279]:
df + 10

      kor  eng  sci
hong   60   60   60
kim   100  100  100
lee    80   80   80

### DataFrame 간 연산

In [280]:
data = { 'kor':[ 50, 90, 70 ], 'eng': [ 50, 90, 70 ], 'math': [ 50, 90, 70 ] }
index_list = [ 'hong', 'kim', 'lee' ]
df2 = pd.DataFrame( data, index = index_list )
df2

      kor  eng  math
hong   50   50    50
kim    90   90    90
lee    70   70    70

In [281]:
df + df2

      eng  kor  math  sci
hong  100  100   NaN  NaN
kim   180  180   NaN  NaN
lee   140  140   NaN  NaN

#### 연산은 기본적으로 구조가 맞아야 연산이 가능, Series와 DataFrame은 연산이 불가능

### DataFrame에 적용하는 함수( 분석시 활용 )

In [401]:
import seaborn as sns

In [402]:
# seaborn은 시각화 패키지, 시각화 패키지 중 가장 시각화가 깔끔함

In [403]:
iris = sns.load_dataset( 'iris' )
iris                                # seaborn은 여기까지만 쓰임 시각화 도구로 결과값만 보여주기 위해 밑에서부터는 dataframe

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [404]:
iris.info()   # R의 str과 비슷한 함수, DataFrame 요약 정보 확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [405]:
iris.Shape    # DataFrame 차원 정보 확인

AttributeError: 'DataFrame' object has no attribute 'Shape'

In [287]:
iris.head()    # DataFrame 처음부터 일부 data 출력

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [288]:
iris.tail()     # head와 반대

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [289]:
iris.describe()   # DataFrame에 대한 기술 통계 정보 출력 / 기초통계이므로 species는 문자열이라 알아서 걸러 줌

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [290]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, hong to lee
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     3 non-null      int64
 1   eng     3 non-null      int64
 2   sci     3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [291]:
df.shape

(3, 3)

In [292]:
df.info

<bound method DataFrame.info of       kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70>

In [293]:
df.head()

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [294]:
df.tail()

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [295]:
df.describe()

        kor   eng   sci
count   3.0   3.0   3.0
mean   70.0  70.0  70.0
std    20.0  20.0  20.0
min    50.0  50.0  50.0
25%    60.0  60.0  60.0
50%    70.0  70.0  70.0
75%    80.0  80.0  80.0
max    90.0  90.0  90.0

In [296]:
iris.count() # 각 열(변수)의 개수

sepal_length    150
sepal_width     150
petal_length    150
petal_width     150
species         150
dtype: int64

In [297]:
iris[ 'sepal_length' ].value_counts() # 각 열(변수)의 고유값 개수  / # 해당하는 변수에 값(ex5.0)이 몇개씩 있나

5.0    10
6.3     9
5.1     9
6.7     8
5.7     8
5.5     7
5.8     7
6.4     7
6.0     6
4.9     6
6.1     6
5.4     6
5.6     6
6.5     5
4.8     5
7.7     4
6.9     4
5.2     4
6.2     4
4.6     4
7.2     3
6.8     3
4.4     3
5.9     3
6.6     2
4.7     2
7.6     1
7.4     1
4.3     1
7.9     1
7.3     1
7.0     1
4.5     1
5.3     1
7.1     1
Name: sepal_length, dtype: int64

In [298]:
df[ 'kor' ].value_counts()

70    1
50    1
90    1
Name: kor, dtype: int64

### 통계함수

In [299]:
iris.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [300]:
iris[ 'sepal_length' ].mean()

5.843333333333335

In [301]:
iris.median() # 중간값

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [302]:
iris[ 'sepal_length' ].median()

5.8

In [303]:
iris.max() # 최댓값

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [304]:
iris[ 'sepal_length' ].max()

7.9

In [305]:
iris.min()

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [306]:
iris[ 'sepal_length' ].min()

4.3

In [307]:
iris.std()  # 표준 편차

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [308]:
iris[ 'sepal_length' ].std()

0.8280661279778629

In [309]:
iris.corr() # 상관 계수

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

In [310]:
iris[ [ 'sepal_length', 'petal_length' ] ].corr()

              sepal_length  petal_length
sepal_length      1.000000      0.871754
petal_length      0.871754      1.000000

In [311]:
df

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [312]:
df.T       # df라는 DataFrame의 행과 열을 바꿈

     hong  kim  lee
kor    50   90   70
eng    50   90   70
sci    50   90   70

### 기술 통계 및 요약 통계 메소드

### 정렬

In [313]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [314]:
iris.sort_values( by = 'petal_width', ascending = True ).head() # iris.head()랑 다른 점은 petal_width의 값이 작은 순으로 정렬한 것

    sepal_length  sepal_width  petal_length  petal_width species
32           5.2          4.1           1.5          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
37           4.9          3.6           1.4          0.1  setosa
9            4.9          3.1           1.5          0.1  setosa
12           4.8          3.0           1.4          0.1  setosa

In [315]:
iris.sort_values( by = 'petal_width', ascending = False ).head() # ascending + True랑 반대 (내림차순)

     sepal_length  sepal_width  petal_length  petal_width    species
100           6.3          3.3           6.0          2.5  virginica
109           7.2          3.6           6.1          2.5  virginica
144           6.7          3.3           5.7          2.5  virginica
114           5.8          2.8           5.1          2.4  virginica
140           6.7          3.1           5.6          2.4  virginica

In [316]:
iris.sort_values( by = [ 'petal_width', 'sepal_length' ], ascending = True ).head()

    sepal_length  sepal_width  petal_length  petal_width species
13           4.3          3.0           1.1          0.1  setosa
12           4.8          3.0           1.4          0.1  setosa
9            4.9          3.1           1.5          0.1  setosa
37           4.9          3.6           1.4          0.1  setosa
32           5.2          4.1           1.5          0.1  setosa

In [317]:
iris.sort_index( ascending = False ).head()    # 인덱스값을 내림순으로 정렬한 것

     sepal_length  sepal_width  petal_length  petal_width    species
149           5.9          3.0           5.1          1.8  virginica
148           6.2          3.4           5.4          2.3  virginica
147           6.5          3.0           5.2          2.0  virginica
146           6.3          2.5           5.0          1.9  virginica
145           6.7          3.0           5.2          2.3  virginica

In [318]:
df

      kor  eng  sci
hong   50   50   50
kim    90   90   90
lee    70   70   70

In [319]:
df.sort_index( ascending = False )

      kor  eng  sci
lee    70   70   70
kim    90   90   90
hong   50   50   50

### 데이터 전처리( Data Preprocessing )

- 결측치 처리

In [327]:
data = { '20200301': [ 50, np.nan, 90, 70, 80 ],
         '20200302': [ 70, 80, 92, 79, 88 ],
         '20200305': [ 92, np.nan, 77, np.nan, 99 ],
         '20200304': [ 82, 95, 100, 87, 65 ],
         '20200303': [ 77, 76, 72, 71, 79 ] }
df = pd.DataFrame( data )
df

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
1       NaN        80       NaN        95        76
2      90.0        92      77.0       100        72
3      70.0        79       NaN        87        71
4      80.0        88      99.0        65        79

In [328]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   20200301  4 non-null      float64
 1   20200302  5 non-null      int64
 2   20200305  3 non-null      float64
 3   20200304  5 non-null      int64
 4   20200303  5 non-null      int64
dtypes: float64(2), int64(3)
memory usage: 328.0 bytes

In [329]:
df[ '20200301' ].value_counts()         # 20200301의 값들의 갯수들을 파악한 것

80.0    1
70.0    1
90.0    1
50.0    1
Name: 20200301, dtype: int64

In [330]:
df[ '20200301' ].value_counts( dropna = False )    # 20200301의 각각 값들의 갯수 파악 nan포함 해서

80.0    1
70.0    1
90.0    1
NaN     1
50.0    1
Name: 20200301, dtype: int64

In [331]:
df[ '20200305' ].value_counts()

99.0    1
77.0    1
92.0    1
Name: 20200305, dtype: int64

In [332]:
df[ '20200305' ].value_counts( dropna = False )

NaN     2
99.0    1
77.0    1
92.0    1
Name: 20200305, dtype: int64

In [333]:
df.head().isnull()            # null = 가치 없는, 누락값 / null( 결측치, 누락값 ) 유무 확인, null이면 true

   20200301  20200302  20200305  20200304  20200303
0     False     False     False     False     False
1      True     False      True     False     False
2     False     False     False     False     False
3     False     False      True     False     False
4     False     False     False     False     False

In [334]:
df.head().isna()               # na가 있는지

   20200301  20200302  20200305  20200304  20200303
0     False     False     False     False     False
1      True     False      True     False     False
2     False     False     False     False     False
3     False     False      True     False     False
4     False     False     False     False     False

In [335]:
df.head().isnull().sum( axis = 1 )   # 행 기준으로 결측치나 누락값의 합 / true는 1이니까 더하면 숫자가 나옴

0    0
1    2
2    0
3    1
4    0
dtype: int64

In [336]:
df.head().isnull().sum()    # axis를 안넣으면 디폴트값은 열별이다

20200301    1
20200302    0
20200305    2
20200304    0
20200303    0
dtype: int64

In [339]:
df.head().notnull()     # null이 아니면 True

   20200301  20200302  20200305  20200304  20200303
0      True      True      True      True      True
1     False      True     False      True      True
2      True      True      True      True      True
3      True      True     False      True      True
4      True      True      True      True      True

### 결측치 제거

- dropna() 메서드 사용

In [340]:
df2 = df[ : ]

In [343]:
df2.dropna()         # na가 있는 행 삭제

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
2      90.0        92      77.0       100        72
4      80.0        88      99.0        65        79

In [346]:
nan_list = df2.dropna() # 삭제된 데이터 return
nan_list

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
2      90.0        92      77.0       100        72
4      80.0        88      99.0        65        79

In [347]:
df2.dropna( axis = 1 )   # 결측치 삭제 메서드 / 열을 삭제

   20200302  20200304  20200303
0        70        82        77
1        80        95        76
2        92       100        72
3        79        87        71
4        88        65        79

In [344]:
df2

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
1       NaN        80       NaN        95        76
2      90.0        92      77.0       100        72
3      70.0        79       NaN        87        71
4      80.0        88      99.0        65        79

In [345]:
df2.dropna( axis = 1, thresh = 1 )         # thresh = 정해진 수 이상의 nan일때만 삭제

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
1       NaN        80       NaN        95        76
2      90.0        92      77.0       100        72
3      70.0        79       NaN        87        71
4      80.0        88      99.0        65        79

In [349]:
df2

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
1       NaN        80       NaN        95        76
2      90.0        92      77.0       100        72
3      70.0        79       NaN        87        71
4      80.0        88      99.0        65        79

In [351]:
# subset = 변수를 정하는 것
# how, any = 결측치가 하나라도 있으면(any)행동 실행, 모든 데이터가 결측치이면(all) 행동 실행
cnt = df2.dropna( subset = [ '20200305' ], how = 'any', axis = 0 )

In [352]:
cnt

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
2      90.0        92      77.0       100        72
4      80.0        88      99.0        65        79

In [353]:
cnt = df2.dropna( subset = [ '20200305' ], how = 'all', axis = 0 )

In [354]:
cnt

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
2      90.0        92      77.0       100        72
4      80.0        88      99.0        65        79

### 결측치 값을 다른값으로 대체

- fillna() 메서드 이용

In [356]:
df2

   20200301  20200302  20200305  20200304  20200303
0      50.0        70      92.0        82        77
1       NaN        80       NaN        95        76
2      90.0        92      77.0       100        72
3      70.0        79       NaN        87        71
4      80.0        88      99.0        65        79

In [357]:
mean_20200301 = df[ '20200301' ].mean()
mean_20200305 = df[ '20200305' ].mean()
mean_20200301, mean_20200305

(72.5, 89.33333333333333)

In [360]:
# 결측치가 있는 열의 평균값으로 결측치를 대체
df2[ '20200301' ].fillna( mean_20200301, inplace = True )
df2[ '20200305' ].fillna( mean_20200305, inplace = True )

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\generic.py:6245: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [372]:
df2

   20200301  20200302   20200305  20200304  20200303  (1, 20200305)
0      50.0        70  92.000000        82        77            2.0
1      72.5        80   2.000000        95        76            2.0
2      90.0        92  77.000000       100        72            2.0
3      70.0        79  89.333333        87        71            2.0
4      80.0        88  99.000000        65        79            2.0

In [373]:
df2.loc[ 1, '20200305' ] = np.nan

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:965: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [378]:
df2

   20200301  20200302   20200305  20200304  20200303  (1, 20200305)
0      50.0        70  92.000000        82        77            2.0
1      72.5        80   2.000000        95        76            2.0
2      90.0        92  77.000000       100        72            2.0
3      70.0        79  89.333333        87        71            2.0
4      80.0        88  99.000000        65        79            2.0

In [385]:
max_20200305 = df2[ '20200305' ].value_counts( dropna = True ) .idxmax()  # 최댓값을 구해서 결측치에 대체시킴
max_20200305

89.33333333333333

In [386]:
df2.fillna( max_20200305, inplace = True ) # 결측치가 있는 열의 가장 큰값으로 대체

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:4153: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  downcast=downcast,

In [387]:
df2

   20200301  20200302   20200305  20200304  20200303  (1, 20200305)
0      50.0        70  92.000000        82        77            2.0
1      72.5        80   2.000000        95        76            2.0
2      90.0        92  77.000000       100        72            2.0
3      70.0        79  89.333333        87        71            2.0
4      80.0        88  99.000000        65        79            2.0

In [389]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [390]:
iris.loc[ 1, 'sepal_length' ] = np.nan

In [391]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           NaN          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [392]:
# 결측치가 포함된 행 이전행의 값으로 대체
iris[ 'sepal_length' ].fillna( method = 'ffill', inplace = True )  # method = 'ffill' ->ffill의 f는 foword 이전값으로 대체 
                                                                    # 이전값이란 이전 행과 열에 있는 값으로 ex) 0행의 5.1

In [393]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           5.1          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

### 중복 데이터 처리

In [395]:
df = pd.DataFrame( { 'A': [ 'a', 'a', 'b', 'a', 'b' ],
                     'B': [ 1, 1, 1, 2, 2 ],
                     'C': [ 1, 1, 1, 2, 2 ] } )
df

   A  B  C
0  a  1  1
1  a  1  1
2  b  1  1
3  a  2  2
4  b  2  2

In [396]:
dup = df.duplicated()  # 중복 데이터 확인 (행)
dup
# 0행은 원래 데이터로 보고 1행을 중복데이터로 봄! 똑같은게 두개나오면 먼저 나온게 원래 데이터로 보고 그 다음 나온게 중복데이터로 봄

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [398]:
dup = df[ 'B' ].duplicated() # 중복 데이터 확인 (열)
dup

0    False
1     True
2     True
3    False
4     True
Name: B, dtype: bool

In [400]:
df = df.drop_duplicates()  # 행 중복 데이터 삭제    # duplicated는 찾아 내는 것 / duplicates는 삭제할 때 쓰는 것
df

   A  B  C
0  a  1  1
2  b  1  1
3  a  2  2
4  b  2  2